package Client;

class Data_test {
	public static String[] Data_client = { //客户端发给数据库的测试用例
			"&01&00zhd15&011234567",
			"&01&00zhoug15&010987564321",
			"&00&00zwx15&01abcdefg&0212345678901&03zwx15@mails.tsinghua.edu.cn&048&05朱文轩&062015012002&07水利学院&084&093",
			"&00&00zhoug15&010987564321&0212345678901&03zhoug15@mails.tsinghua.edu.cn&048&05周乾&062015012031&07水利学院&084&093",
			"&02&062015012031&00zhoug15&010987564321&0212345678901&03zhoug15@mails.tsinghua.edu.cn&048&05郝青硕&07水利工程学院&084&093",
			"&03&062015012031" };
	
	public static String[] Data_dbms = { //数据库发给客户端的测试用例
		"&03&000&012015012031&02zhoug15&0312345678901&04zhoug15@mails.tsinghua.edu.cn&050108&06郝青硕"
		+ "&08水利工程学院&090104&10&11100&12100&1320", // 03指令：数据库发送用户信息
		"&55&000&013&020&030&04东东&05西西&1701234567890&1812345678900&063&0718:00前到紫荆14号楼后小树林取顺丰快递"
		+ "&101234&115&12&150101&1612210913&080108&0912211823" // 55指令：数据库发送单个任务详细信息	
	};
}