package com.example.lazy_man_client;

class Data_all {
	public static String User_ID; //用户ID，全局变量
	
	// 物件重量/大小
	public static String[] Size = { "超大", "大", "一般", "小", "很小" }; 
	
	// 区域列表与地址列表（每个列表首项都为空，为了在下拉菜单中显示一个空项！）
	public static String[] Section = { "", "紫荆宿舍区", "南区宿舍区", "三四五六教", "大礼堂附近", "东南门附近" }; //地址分区
	public static String[][] Address = {
		{
			// 为了对应，加了一个空数组
            ""
		},
		{
			"","紫荆14号楼后小树林","C楼","紫荆1号楼","紫荆2号楼","紫荆3号楼","紫荆4号楼","紫荆5号楼","紫荆6号楼","紫荆7号楼","紫荆8号楼",
			"紫荆9号楼","紫荆10号楼","紫荆11号楼","紫荆12号楼","紫荆13号楼","紫荆14号楼","紫荆15号楼","紫荆16号楼","紫荆17号楼","紫荆18号楼",
			"紫荆19号楼",	"紫荆20号楼","紫荆21号楼","紫荆22号楼","紫荆23号楼"
		},
		{
			"","1号楼","2号楼","3号楼","4号楼","5号楼","6号楼","7号楼","8号楼","9号楼","10号楼","11号楼","12号楼","13号楼","14号楼","15号楼",
			"16号楼","17号楼","18号楼","19号楼","20号楼","21号楼","22号楼","23号楼","24号楼","25号楼","26号楼","27号楼","28号楼","29号楼",
			"30号楼","31号楼","32号楼","33号楼","34号楼","35号楼","36号楼","37号楼"
		},
		{
			"","三教一段","三教二段","三教三段","四教","五教","六教A区","六教B区","六教C区","泥沙馆","人文社科图书馆","土木馆","新清华学堂",
			"文南楼","文北楼"
		},
		{
			"","大礼堂","新水利馆","一教","二教","旧水利馆","清华学堂","老馆","逸夫馆","北馆","西阶梯教室"
		},
		{
			"","中央主楼","东主楼","西主楼","工物馆","经管楼","经管西楼","公管学院","法学院","FIT楼","逸夫技科楼","建筑馆","美术学院"
		}
	};
}